[
    {
    "title": "Week 1",
    "date": "Friday, Week 1",
    "author": "Jess McArthur",
    "content": "What went well? This week was the beginning of Term 2 and the start of a new brief focused on creating a social enterprise. I was able to understand the brief clearly and had a good idea of the tasks that needed to be completed each week. I quickly came up with ideas for areas of interest and developed relevant questions to ask participants, which gave me a solid starting point. What didn’t go well? Unfortunately, my laptop broke on the second day of class, which caused quite a bit of stress and uncertainty. This unexpected setback left me feeling a little behind in my work and disrupted my usual workflow. What can be improved? One thing I can improve on is reaching out more to lecturers when I need clarification. Instead of sitting with confusion or uncertainty, I need to be more proactive in asking questions to stay on track. What actions will I take for the next sprint? Next week, I will aim to communicate more with my lecturers to clarify any parts of the brief or tasks I’m unsure about. On top of that, I’ll work on solidifying my target audience and start ideating solutions to my problem statement."
},

{
    "title": "Week 2",
    "date": " Friday, Week 2",
    "author": "Jess McArthur",
    "content": "What went well? My research went really well and gave me strong insights into the real problems faced by small business owners. This helped me narrow down and define a clear, specific problem to solve. My WIP presentation also went well, I received valuable feedback that helped clarify my direction moving forward. What didn’t go well? After completing my WIP, I lost some motivation and didn’t make as much progress as I could have. It was a bit of a pause on the assignment. What can be improved? I need to work on maintaining steady progress even after big milestones like the WIP. Keeping up the momentum will help me stay on track and avoid falling behind. What actions will I take for the next sprint? Next week, I need to start picturing how my solution will work from a user experience perspective. I’ll begin developing a lo-fi prototype to visualise and test the flow of my idea."
},

{
    "title": " Week 3",
    "date": "Friday, Week 3",
    "author": "Jess McArthur",
    "content": "What went well? This week, I stayed on track with my prototyping and testing goals. I successfully completed my lo-fi prototype, conducted user testing, and made thoughtful updates based on feedback—such as improving the login experience and removing unnecessary features like the recipes page. I also made solid progress in developing my concept for the type here brief, exploring different visual ideas. What didn’t go well? There weren’t any major setbacks or issues this week. I was able to stay on schedule with my prototyping and testing, and all tasks progressed smoothly. While there’s always room for refinement, overall everything went according to plan, and I felt productive and focused throughout the week. What can be improved? Next week, I can improve by focusing more on refining the visual design and ensuring consistency across screens. I also want to push my concept further for the type here brief by exploring more creative ways to communicate my idea. What actions will I take for the next sprint? Next week I will revisit my visual design choices to ensure alignment with the brand’s tone and overall strategy and seek additional feedback from lecturers to strengthen design choices."
},

{
    "title": " Week 4",
    "date": "Friday, Week 4",
    "author": "Jess McArthur",
    "content": "What went well? This week I made strong progress on developing my brand identity. I refined my logo concepts, explored new directions based on feedback, and successfully integrated these elements into my presentation. The visual design is now more representative of my concept. I also felt confident and well-prepared for my proposal presentation, which I delivered successfully. Receiving and implementing feedback helped me further strengthen my overall direction. What didn’t go well? Although the week was productive, I fell behind on my Design Strategy document. As a result, I had to use time on Friday to finalise the document. This reduced the amount of time I had to focus on prototyping and experimenting with interactive outcomes, putting me slightly behind where I wanted to be with that brief. What can be improved? Time management across overlapping deadlines needs to be improved to ensure each project receives adequate attention without sacrificing progress. I also want to avoid last-minute work that cuts into time allocated for other briefs. What actions will I take for the next sprint? Set clearer daily goals for each project to avoid lapping over and ensure steady progress across both briefs."
},

{
    "title": " Week 5",
    "date": "Friday, Week 5",
    "author": "Jess McArthur",
    "content": "What went well? This week, I made solid progress on my hi-fi prototype, refining the design and functionality significantly. The visuals and user flow are now much more refined, after the feedback I received from Melody. Their comments helped me move in a better direction as I was feeling a bit stuck. What didn’t go well? One area that could have used more attention was the type brief. I didn’t spend as much time building my prototype as I should have. Additionally, I could have conducted user testing this week. What can be improved? I need to allocate more time to the type brief to ensure I am on track for the due date. What actions will I take for the next sprint? I will dedicate more time to refining my type poster and user testing my hi-fi to gain more feedback and check its functionality."
}
]